Failed to reposition part.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
 Syntax
  C#
public static FailureDefinitionId PinnedFabricationPartNotReposition { get; }
  Visual Basic
Public Shared ReadOnly Property PinnedFabricationPartNotReposition As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ PinnedFabricationPartNotReposition {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures MEPFabricationFailures Class
  Autodesk.Revit.DB Namespace